app/controllers/comments_controller.rb

SELECT * FROM `comments` WHERE (`comments`.`id` = 2)
---
  def edit
    redirect_to :controller => "posts", :action => "index" unless session[:logged_in]
    @comment = Comment.find(params[:id])

INSERT INTO "comments" ("created_at", "author", "updated_at", "post_id", "content") VALUES('2009-05-03 23:16:37', 'Batman', '2009-05-03 23:16:37', NULL, 'I am vengeance, I am the night, I am Batman.')
---
  def create
    @comment = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save

SELECT * FROM `comments` WHERE (`comments`.`id` = 2)
UPDATE `comments` SET `content` = 'on second thought, my chemical symbol is probably actually AWESOMe', `updated_at` = '2009-03-25 15:13:19' WHERE `id` = 2
SELECT * FROM "posts" WHERE ("posts"."id" = 2)
---
  def update
    @comment = Comment.find(params[:id])

    respond_to do |format|
      if @comment.update_attributes(params[:comment])
        flash[:notice] = 'Comment was successfully updated.'
        format.html { redirect_to(Post.find(@comment[:post_id])) }