app/controllers/posts_controller.rb

  def edit
    redirect_to :action => "index" unless session[:logged_in]
    @post = Post.find(params[:id])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("updated_at", "title", "content", "created_at") VALUES('2009-04-10 01:10:24', 'Lorem Ipsum', 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Phasellus dictum tempor dui. Donec sit amet justo porttitor dui blandit euismod. Mauris dignissim tincidunt nulla. Suspendisse egestas iaculis nibh. Nam libero purus, ultrices ac, convallis quis, luctus laoreet, dui. Cras elit enim, ultrices quis, viverra nec, convallis non, justo. Duis lacus elit, malesuada vel, feugiat ornare, posuere non, massa. Donec et massa. Proin convallis orci ac nibh. Proin diam mauris, posuere sed, egestas ac, lacinia sed, eros.

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
UPDATE "posts" SET "updated_at" = '2009-05-05 02:34:07', "content" = '<p>Lorem ipsum dolor sit amet, consectetur adipiscing elit. Phasellus dictum tempor dui. Donec sit amet justo porttitor dui blandit euismod. Mauris dignissim tincidunt nulla. Suspendisse egestas iaculis nibh. Nam libero purus, ultrices ac, convallis quis, luctus laoreet, dui. Cras elit enim, ultrices quis, viverra nec, convallis non, justo. Duis lacus elit, malesuada vel, feugiat ornare, posuere non, massa. Donec et massa. Proin convallis orci ac nibh. Proin diam mauris, posuere sed, egestas ac, lacinia sed, eros.</p>